app/controllers/order_lists_controller.rb

SELECT * FROM `order_lists`
---
  def index
    @order_lists = OrderList.all

SELECT * FROM `order_lists` WHERE (`order_lists`.`id` = 1)
---
  def show
    @order_list = OrderList.find(params[:id])

SELECT * FROM `order_lists` WHERE (`order_lists`.`id` = 3)
---
  def edit
    @order_list = OrderList.find(params[:id])

INSERT INTO `order_lists` (`order_date`, `created_at`, `updated_at`, `user_id`, `order_no`, `state`) VALUES('2011-03-16', '2011-03-16 11:52:16', '2011-03-16 11:52:16', 0, 'e3', 0)
---
  def create
    @order_list = OrderList.new(params[:order_list])

    respond_to do |format|
      if @order_list.save

SELECT * FROM `order_lists` WHERE (`order_lists`.`id` = 3)
UPDATE `order_lists` SET `updated_at` = '2011-03-21 13:25:34', `order_date` = '2008-03-16' WHERE `id` = 1
---
  def update
    @order_list = OrderList.find(params[:id])

    respond_to do |format|
      if @order_list.update_attributes(params[:order_list])